---
kind: method
id: M:Autodesk.Revit.DB.TriangleInShellComponent.Dispose
source: html/793d46f8-bba8-5500-6bf1-8a1879a7df40.htm
---
# Autodesk.Revit.DB.TriangleInShellComponent.Dispose Method

Releases all resources used by the TriangleInShellComponent

## Syntax (C#)
```csharp
public void Dispose()
```